GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.h
extern volatile IOCBPbits_t IOCBPbits __at(0x3A55);
// bitfield macros
#define _IOCBP_IOCBP0_POSN                                  0x0
#define _IOCBP_IOCBP0_POSITION                              0x0
#define _IOCBP_IOCBP0_SIZE                                  0x1
#define _IOCBP_IOCBP0_LENGTH                                0x1
#define _IOCBP_IOCBP0_MASK                                  0x1
#define _IOCBP_IOCBP1_POSN                                  0x1
#define _IOCBP_IOCBP1_POSITION                              0x1
#define _IOCBP_IOCBP1_SIZE                                  0x1
#define _IOCBP_IOCBP1_LENGTH                                0x1
#define _IOCBP_IOCBP1_MASK                                  0x2
#define _IOCBP_IOCBP2_POSN                                  0x2
#define _IOCBP_IOCBP2_POSITION                              0x2
#define _IOCBP_IOCBP2_SIZE                                  0x1
#define _IOCBP_IOCBP2_LENGTH                                0x1
#define _IOCBP_IOCBP2_MASK                                  0x4
#define _IOCBP_IOCBP3_POSN                                  0x3
#define _IOCBP_IOCBP3_POSITION                              0x3
#define _IOCBP_IOCBP3_SIZE                                  0x1
#define _IOCBP_IOCBP3_LENGTH                                0x1
#define _IOCBP_IOCBP3_MASK                                  0x8
#define _IOCBP_IOCBP4_POSN                                  0x4
#define _IOCBP_IOCBP4_POSITION                              0x4
#define _IOCBP_IOCBP4_SIZE                                  0x1
#define _IOCBP_IOCBP4_LENGTH                                0x1
#define _IOCBP_IOCBP4_MASK                                  0x10
#define _IOCBP_IOCBP5_POSN                                  0x5
#define _IOCBP_IOCBP5_POSITION                              0x5
#define _IOCBP_IOCBP5_SIZE                                  0x1
#define _IOCBP_IOCBP5_LENGTH                                0x1
#define _IOCBP_IOCBP5_MASK                                  0x20
#define _IOCBP_IOCBP6_POSN                                  0x6
#define _IOCBP_IOCBP6_POSITION                              0x6
#define _IOCBP_IOCBP6_SIZE                                  0x1
#define _IOCBP_IOCBP6_LENGTH                                0x1
#define _IOCBP_IOCBP6_MASK                                  0x40
#define _IOCBP_IOCBP7_POSN                                  0x7
#define _IOCBP_IOCBP7_POSITION                              0x7
#define _IOCBP_IOCBP7_SIZE                                  0x1
#define _IOCBP_IOCBP7_LENGTH                                0x1
#define _IOCBP_IOCBP7_MASK                                  0x80

// Register: IOCBN
#define IOCBN IOCBN
extern volatile unsigned char           IOCBN               __at(0x3A56);
#ifndef _LIB_BUILD
asm("IOCBN equ 03A56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCBN0                 :1;
        unsigned IOCBN1                 :1;
        unsigned IOCBN2                 :1;
        unsigned IOCBN3                 :1;
        unsigned IOCBN4                 :1;
        unsigned IOCBN5                 :1;
        unsigned IOCBN6                 :1;
        unsigned IOCBN7                 :1;
    };
} IOCBNbits_t;
extern volatile IOCBNbits_t IOCBNbits __at(0x3A56);
// bitfield macros
#define _IOCBN_IOCBN0_POSN                                  0x0
#define _IOCBN_IOCBN0_POSITION                              0x0
#define _IOCBN_IOCBN0_SIZE                                  0x1
#define _IOCBN_IOCBN0_LENGTH                                0x1
#define _IOCBN_IOCBN0_MASK                                  0x1
#define _IOCBN_IOCBN1_POSN                                  0x1
#define _IOCBN_IOCBN1_POSITION                              0x1
#define _IOCBN_IOCBN1_SIZE                                  0x1
#define _IOCBN_IOCBN1_LENGTH                                0x1
#define _IOCBN_IOCBN1_MASK                                  0x2
#define _IOCBN_IOCBN2_POSN                                  0x2
#define _IOCBN_IOCBN2_POSITION                              0x2
#define _IOCBN_IOCBN2_SIZE                                  0x1
#define _IOCBN_IOCBN2_LENGTH                                0x1
#define _IOCBN_IOCBN2_MASK                                  0x4
#define _IOCBN_IOCBN3_POSN                                  0x3
#define _IOCBN_IOCBN3_POSITION                              0x3
#define _IOCBN_IOCBN3_SIZE                                  0x1
#define _IOCBN_IOCBN3_LENGTH                                0x1
#define _IOCBN_IOCBN3_MASK                                  0x8
#define _IOCBN_IOCBN4_POSN                                  0x4
#define _IOCBN_IOCBN4_POSITION                              0x4
#define _IOCBN_IOCBN4_SIZE                                  0x1
#define _IOCBN_IOCBN4_LENGTH                                0x1
#define _IOCBN_IOCBN4_MASK                                  0x10
#define _IOCBN_IOCBN5_POSN                                  0x5
#define _IOCBN_IOCBN5_POSITION                              0x5
#define _IOCBN_IOCBN5_SIZE                                  0x1
#define _IOCBN_IOCBN5_LENGTH                                0x1
#define _IOCBN_IOCBN5_MASK                                  0x20
#define _IOCBN_IOCBN6_POSN                                  0x6
#define _IOCBN_IOCBN6_POSITION                              0x6
#define _IOCBN_IOCBN6_SIZE                                  0x1
#define _IOCBN_IOCBN6_LENGTH                                0x1
#define _IOCBN_IOCBN6_MASK                                  0x40
#define _IOCBN_IOCBN7_POSN                                  0x7
#define _IOCBN_IOCBN7_POSITION                              0x7
#define _IOCBN_IOCBN7_SIZE                                  0x1
#define _IOCBN_IOCBN7_LENGTH                                0x1
#define _IOCBN_IOCBN7_MASK                                  0x80

// Register: IOCBF
#define IOCBF IOCBF
extern volatile unsigned char           IOCBF               __at(0x3A57);
#ifndef _LIB_BUILD
asm("IOCBF equ 03A57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCBF0                 :1;
        unsigned IOCBF1                 :1;
        unsigned IOCBF2                 :1;
        unsigned IOCBF3                 :1;
        unsigned IOCBF4                 :1;
        unsigned IOCBF5                 :1;
        unsigned IOCBF6                 :1;
        unsigned IOCBF7                 :1;
    };
} IOCBFbits_t;
extern volatile IOCBFbits_t IOCBFbits __at(0x3A57);
// bitfield macros
#define _IOCBF_IOCBF0_POSN                                  0x0
#define _IOCBF_IOCBF0_POSITION                              0x0
#define _IOCBF_IOCBF0_SIZE                                  0x1
#define _IOCBF_IOCBF0_LENGTH                                0x1
#define _IOCBF_IOCBF0_MASK                                  0x1
#define _IOCBF_IOCBF1_POSN                                  0x1
#define _IOCBF_IOCBF1_POSITION                              0x1
#define _IOCBF_IOCBF1_SIZE                                  0x1
#define _IOCBF_IOCBF1_LENGTH                                0x1
#define _IOCBF_IOCBF1_MASK                                  0x2
#define _IOCBF_IOCBF2_POSN                                  0x2
#define _IOCBF_IOCBF2_POSITION                              0x2
#define _IOCBF_IOCBF2_SIZE                                  0x1
#define _IOCBF_IOCBF2_LENGTH                                0x1
#define _IOCBF_IOCBF2_MASK                                  0x4
#define _IOCBF_IOCBF3_POSN                                  0x3
#define _IOCBF_IOCBF3_POSITION                              0x3
#define _IOCBF_IOCBF3_SIZE                                  0x1
#define _IOCBF_IOCBF3_LENGTH                                0x1
#define _IOCBF_IOCBF3_MASK                                  0x8
#define _IOCBF_IOCBF4_POSN                                  0x4
#define _IOCBF_IOCBF4_POSITION                              0x4
#define _IOCBF_IOCBF4_SIZE                                  0x1
#define _IOCBF_IOCBF4_LENGTH                                0x1
#define _IOCBF_IOCBF4_MASK                                  0x10
#define _IOCBF_IOCBF5_POSN                                  0x5
#define _IOCBF_IOCBF5_POSITION                              0x5
#define _IOCBF_IOCBF5_SIZE                                  0x1
#define _IOCBF_IOCBF5_LENGTH                                0x1
#define _IOCBF_IOCBF5_MASK                                  0x20
#define _IOCBF_IOCBF6_POSN                                  0x6
#define _IOCBF_IOCBF6_POSITION                              0x6
#define _IOCBF_IOCBF6_SIZE                                  0x1
#define _IOCBF_IOCBF6_LENGTH                                0x1
#define _IOCBF_IOCBF6_MASK                                  0x40
#define _IOCBF_IOCBF7_POSN                                  0x7
#define _IOCBF_IOCBF7_POSITION                              0x7
#define _IOCBF_IOCBF7_SIZE                                  0x1
#define _IOCBF_IOCBF7_LENGTH                                0x1
#define _IOCBF_IOCBF7_MASK                                  0x80

// Register: CCDPB
#define CCDPB CCDPB
extern volatile unsigned char           CCDPB               __at(0x3A58);
#ifndef _LIB_BUILD
asm("CCDPB equ 03A58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPB0                 :1;
        unsigned CCDPB1                 :1;
        unsigned CCDPB2                 :1;
        unsigned CCDPB3                 :1;
        unsigned CCDPB4                 :1;
        unsigned CCDPB5                 :1;
        unsigned CCDPB6                 :1;
        unsigned CCDPB7                 :1;
    };
} CCDPBbits_t;
extern volatile CCDPBbits_t CCDPBbits __at(0x3A58);
// bitfield macros
#define _CCDPB_CCDPB0_POSN                                  0x0
#define _CCDPB_CCDPB0_POSITION                              0x0
#define _CCDPB_CCDPB0_SIZE                                  0x1
#define _CCDPB_CCDPB0_LENGTH                                0x1
#define _CCDPB_CCDPB0_MASK                                  0x1
#define _CCDPB_CCDPB1_POSN                                  0x1
#define _CCDPB_CCDPB1_POSITION                              0x1
#define _CCDPB_CCDPB1_SIZE                                  0x1
#define _CCDPB_CCDPB1_LENGTH                                0x1
#define _CCDPB_CCDPB1_MASK                                  0x2
#define _CCDPB_CCDPB2_POSN                                  0x2
#define _CCDPB_CCDPB2_POSITION                              0x2
#define _CCDPB_CCDPB2_SIZE                                  0x1
#define _CCDPB_CCDPB2_LENGTH                                0x1
#define _CCDPB_CCDPB2_MASK                                  0x4
#define _CCDPB_CCDPB3_POSN                                  0x3
#define _CCDPB_CCDPB3_POSITION                              0x3
#define _CCDPB_CCDPB3_SIZE                                  0x1
#define _CCDPB_CCDPB3_LENGTH                                0x1
#define _CCDPB_CCDPB3_MASK                                  0x8
#define _CCDPB_CCDPB4_POSN                                  0x4
#define _CCDPB_CCDPB4_POSITION                              0x4
#define _CCDPB_CCDPB4_SIZE                                  0x1
#define _CCDPB_CCDPB4_LENGTH                                0x1
#define _CCDPB_CCDPB4_MASK                                  0x10
#define _CCDPB_CCDPB5_POSN                                  0x5
#define _CCDPB_CCDPB5_POSITION                              0x5
#define _CCDPB_CCDPB5_SIZE                                  0x1
#define _CCDPB_CCDPB5_LENGTH                                0x1
#define _CCDPB_CCDPB5_MASK                                  0x20
#define _CCDPB_CCDPB6_POSN                                  0x6
#define _CCDPB_CCDPB6_POSITION                              0x6
#define _CCDPB_CCDPB6_SIZE                                  0x1
#define _CCDPB_CCDPB6_LENGTH                                0x1
#define _CCDPB_CCDPB6_MASK                                  0x40
#define _CCDPB_CCDPB7_POSN                                  0x7
#define _CCDPB_CCDPB7_POSITION                              0x7
#define _CCDPB_CCDPB7_SIZE                                  0x1
#define _CCDPB_CCDPB7_LENGTH                                0x1
#define _CCDPB_CCDPB7_MASK                                  0x80

// Register: CCDNB
#define CCDNB CCDNB
extern volatile unsigned char           CCDNB               __at(0x3A59);
#ifndef _LIB_BUILD
asm("CCDNB equ 03A59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNB0                 :1;
        unsigned CCDNB1                 :1;
        unsigned CCDNB2                 :1;
        unsigned CCDNB3                 :1;
        unsigned CCDNB4                 :1;
        unsigned CCDNB5                 :1;
        unsigned CCDNB6                 :1;
        unsigned CCDNB7                 :1;
    };
} CCDNBbits_t;
