GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.h
extern volatile INLVLDbits_t INLVLDbits __at(0x3A74);
// bitfield macros
#define _INLVLD_INLVLD0_POSN                                0x0
#define _INLVLD_INLVLD0_POSITION                            0x0
#define _INLVLD_INLVLD0_SIZE                                0x1
#define _INLVLD_INLVLD0_LENGTH                              0x1
#define _INLVLD_INLVLD0_MASK                                0x1
#define _INLVLD_INLVLD1_POSN                                0x1
#define _INLVLD_INLVLD1_POSITION                            0x1
#define _INLVLD_INLVLD1_SIZE                                0x1
#define _INLVLD_INLVLD1_LENGTH                              0x1
#define _INLVLD_INLVLD1_MASK                                0x2
#define _INLVLD_INLVLD2_POSN                                0x2
#define _INLVLD_INLVLD2_POSITION                            0x2
#define _INLVLD_INLVLD2_SIZE                                0x1
#define _INLVLD_INLVLD2_LENGTH                              0x1
#define _INLVLD_INLVLD2_MASK                                0x4
#define _INLVLD_INLVLD3_POSN                                0x3
#define _INLVLD_INLVLD3_POSITION                            0x3
#define _INLVLD_INLVLD3_SIZE                                0x1
#define _INLVLD_INLVLD3_LENGTH                              0x1
#define _INLVLD_INLVLD3_MASK                                0x8
#define _INLVLD_INLVLD4_POSN                                0x4
#define _INLVLD_INLVLD4_POSITION                            0x4
#define _INLVLD_INLVLD4_SIZE                                0x1
#define _INLVLD_INLVLD4_LENGTH                              0x1
#define _INLVLD_INLVLD4_MASK                                0x10
#define _INLVLD_INLVLD5_POSN                                0x5
#define _INLVLD_INLVLD5_POSITION                            0x5
#define _INLVLD_INLVLD5_SIZE                                0x1
#define _INLVLD_INLVLD5_LENGTH                              0x1
#define _INLVLD_INLVLD5_MASK                                0x20
#define _INLVLD_INLVLD6_POSN                                0x6
#define _INLVLD_INLVLD6_POSITION                            0x6
#define _INLVLD_INLVLD6_SIZE                                0x1
#define _INLVLD_INLVLD6_LENGTH                              0x1
#define _INLVLD_INLVLD6_MASK                                0x40
#define _INLVLD_INLVLD7_POSN                                0x7
#define _INLVLD_INLVLD7_POSITION                            0x7
#define _INLVLD_INLVLD7_SIZE                                0x1
#define _INLVLD_INLVLD7_LENGTH                              0x1
#define _INLVLD_INLVLD7_MASK                                0x80

// Register: CCDPD
#define CCDPD CCDPD
extern volatile unsigned char           CCDPD               __at(0x3A78);
#ifndef _LIB_BUILD
asm("CCDPD equ 03A78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPD0                 :1;
        unsigned CCDPD1                 :1;
        unsigned CCDPD2                 :1;
        unsigned CCDPD3                 :1;
        unsigned CCDPD4                 :1;
        unsigned CCDPD5                 :1;
        unsigned CCDPD6                 :1;
        unsigned CCDPD7                 :1;
    };
} CCDPDbits_t;
extern volatile CCDPDbits_t CCDPDbits __at(0x3A78);
// bitfield macros
#define _CCDPD_CCDPD0_POSN                                  0x0
#define _CCDPD_CCDPD0_POSITION                              0x0
#define _CCDPD_CCDPD0_SIZE                                  0x1
#define _CCDPD_CCDPD0_LENGTH                                0x1
#define _CCDPD_CCDPD0_MASK                                  0x1
#define _CCDPD_CCDPD1_POSN                                  0x1
#define _CCDPD_CCDPD1_POSITION                              0x1
#define _CCDPD_CCDPD1_SIZE                                  0x1
#define _CCDPD_CCDPD1_LENGTH                                0x1
#define _CCDPD_CCDPD1_MASK                                  0x2
#define _CCDPD_CCDPD2_POSN                                  0x2
#define _CCDPD_CCDPD2_POSITION                              0x2
#define _CCDPD_CCDPD2_SIZE                                  0x1
#define _CCDPD_CCDPD2_LENGTH                                0x1
#define _CCDPD_CCDPD2_MASK                                  0x4
#define _CCDPD_CCDPD3_POSN                                  0x3
#define _CCDPD_CCDPD3_POSITION                              0x3
#define _CCDPD_CCDPD3_SIZE                                  0x1
#define _CCDPD_CCDPD3_LENGTH                                0x1
#define _CCDPD_CCDPD3_MASK                                  0x8
#define _CCDPD_CCDPD4_POSN                                  0x4
#define _CCDPD_CCDPD4_POSITION                              0x4
#define _CCDPD_CCDPD4_SIZE                                  0x1
#define _CCDPD_CCDPD4_LENGTH                                0x1
#define _CCDPD_CCDPD4_MASK                                  0x10
#define _CCDPD_CCDPD5_POSN                                  0x5
#define _CCDPD_CCDPD5_POSITION                              0x5
#define _CCDPD_CCDPD5_SIZE                                  0x1
#define _CCDPD_CCDPD5_LENGTH                                0x1
#define _CCDPD_CCDPD5_MASK                                  0x20
#define _CCDPD_CCDPD6_POSN                                  0x6
#define _CCDPD_CCDPD6_POSITION                              0x6
#define _CCDPD_CCDPD6_SIZE                                  0x1
#define _CCDPD_CCDPD6_LENGTH                                0x1
#define _CCDPD_CCDPD6_MASK                                  0x40
#define _CCDPD_CCDPD7_POSN                                  0x7
#define _CCDPD_CCDPD7_POSITION                              0x7
#define _CCDPD_CCDPD7_SIZE                                  0x1
#define _CCDPD_CCDPD7_LENGTH                                0x1
#define _CCDPD_CCDPD7_MASK                                  0x80

// Register: CCDND
#define CCDND CCDND
extern volatile unsigned char           CCDND               __at(0x3A79);
#ifndef _LIB_BUILD
asm("CCDND equ 03A79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDND0                 :1;
        unsigned CCDND1                 :1;
        unsigned CCDND2                 :1;
        unsigned CCDND3                 :1;
        unsigned CCDND4                 :1;
        unsigned CCDND5                 :1;
        unsigned CCDND6                 :1;
        unsigned CCDND7                 :1;
    };
} CCDNDbits_t;
extern volatile CCDNDbits_t CCDNDbits __at(0x3A79);
// bitfield macros
#define _CCDND_CCDND0_POSN                                  0x0
#define _CCDND_CCDND0_POSITION                              0x0
#define _CCDND_CCDND0_SIZE                                  0x1
#define _CCDND_CCDND0_LENGTH                                0x1
#define _CCDND_CCDND0_MASK                                  0x1
#define _CCDND_CCDND1_POSN                                  0x1
#define _CCDND_CCDND1_POSITION                              0x1
#define _CCDND_CCDND1_SIZE                                  0x1
#define _CCDND_CCDND1_LENGTH                                0x1
#define _CCDND_CCDND1_MASK                                  0x2
#define _CCDND_CCDND2_POSN                                  0x2
#define _CCDND_CCDND2_POSITION                              0x2
#define _CCDND_CCDND2_SIZE                                  0x1
#define _CCDND_CCDND2_LENGTH                                0x1
#define _CCDND_CCDND2_MASK                                  0x4
#define _CCDND_CCDND3_POSN                                  0x3
#define _CCDND_CCDND3_POSITION                              0x3
#define _CCDND_CCDND3_SIZE                                  0x1
#define _CCDND_CCDND3_LENGTH                                0x1
#define _CCDND_CCDND3_MASK                                  0x8
#define _CCDND_CCDND4_POSN                                  0x4
#define _CCDND_CCDND4_POSITION                              0x4
#define _CCDND_CCDND4_SIZE                                  0x1
#define _CCDND_CCDND4_LENGTH                                0x1
#define _CCDND_CCDND4_MASK                                  0x10
#define _CCDND_CCDND5_POSN                                  0x5
#define _CCDND_CCDND5_POSITION                              0x5
#define _CCDND_CCDND5_SIZE                                  0x1
#define _CCDND_CCDND5_LENGTH                                0x1
#define _CCDND_CCDND5_MASK                                  0x20
#define _CCDND_CCDND6_POSN                                  0x6
#define _CCDND_CCDND6_POSITION                              0x6
#define _CCDND_CCDND6_SIZE                                  0x1
#define _CCDND_CCDND6_LENGTH                                0x1
#define _CCDND_CCDND6_MASK                                  0x40
#define _CCDND_CCDND7_POSN                                  0x7
#define _CCDND_CCDND7_POSITION                              0x7
#define _CCDND_CCDND7_SIZE                                  0x1
#define _CCDND_CCDND7_LENGTH                                0x1
#define _CCDND_CCDND7_MASK                                  0x80

