GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.h
extern volatile CWG2INPPSbits_t CWG2INPPSbits __at(0x3AD4);
// bitfield macros
#define _CWG2INPPS_CWG2INPPS_POSN                           0x0
#define _CWG2INPPS_CWG2INPPS_POSITION                       0x0
#define _CWG2INPPS_CWG2INPPS_SIZE                           0x6
#define _CWG2INPPS_CWG2INPPS_LENGTH                         0x6
#define _CWG2INPPS_CWG2INPPS_MASK                           0x3F

// Register: CWG3INPPS
#define CWG3INPPS CWG3INPPS
extern volatile unsigned char           CWG3INPPS           __at(0x3AD5);
#ifndef _LIB_BUILD
asm("CWG3INPPS equ 03AD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG3INPPS              :6;
    };
} CWG3INPPSbits_t;
extern volatile CWG3INPPSbits_t CWG3INPPSbits __at(0x3AD5);
// bitfield macros
#define _CWG3INPPS_CWG3INPPS_POSN                           0x0
#define _CWG3INPPS_CWG3INPPS_POSITION                       0x0
#define _CWG3INPPS_CWG3INPPS_SIZE                           0x6
#define _CWG3INPPS_CWG3INPPS_LENGTH                         0x6
#define _CWG3INPPS_CWG3INPPS_MASK                           0x3F

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
extern volatile unsigned char           MD1CARLPPS          __at(0x3AD6);
#ifndef _LIB_BUILD
asm("MD1CARLPPS equ 03AD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CARLPPS             :6;
    };
} MD1CARLPPSbits_t;
extern volatile MD1CARLPPSbits_t MD1CARLPPSbits __at(0x3AD6);
// bitfield macros
#define _MD1CARLPPS_MD1CARLPPS_POSN                         0x0
#define _MD1CARLPPS_MD1CARLPPS_POSITION                     0x0
#define _MD1CARLPPS_MD1CARLPPS_SIZE                         0x6
#define _MD1CARLPPS_MD1CARLPPS_LENGTH                       0x6
#define _MD1CARLPPS_MD1CARLPPS_MASK                         0x3F

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
extern volatile unsigned char           MD1CARHPPS          __at(0x3AD7);
#ifndef _LIB_BUILD
asm("MD1CARHPPS equ 03AD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CARHPPS             :6;
    };
} MD1CARHPPSbits_t;
extern volatile MD1CARHPPSbits_t MD1CARHPPSbits __at(0x3AD7);
// bitfield macros
#define _MD1CARHPPS_MD1CARHPPS_POSN                         0x0
#define _MD1CARHPPS_MD1CARHPPS_POSITION                     0x0
#define _MD1CARHPPS_MD1CARHPPS_SIZE                         0x6
#define _MD1CARHPPS_MD1CARHPPS_LENGTH                       0x6
#define _MD1CARHPPS_MD1CARHPPS_MASK                         0x3F

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
extern volatile unsigned char           MD1SRCPPS           __at(0x3AD8);
#ifndef _LIB_BUILD
asm("MD1SRCPPS equ 03AD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1SRCPPS              :6;
    };
} MD1SRCPPSbits_t;
extern volatile MD1SRCPPSbits_t MD1SRCPPSbits __at(0x3AD8);
// bitfield macros
#define _MD1SRCPPS_MD1SRCPPS_POSN                           0x0
#define _MD1SRCPPS_MD1SRCPPS_POSITION                       0x0
#define _MD1SRCPPS_MD1SRCPPS_SIZE                           0x6
#define _MD1SRCPPS_MD1SRCPPS_LENGTH                         0x6
#define _MD1SRCPPS_MD1SRCPPS_MASK                           0x3F

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0x3AD9);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 03AD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN0PPS              :6;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0x3AD9);
// bitfield macros
#define _CLCIN0PPS_CLCIN0PPS_POSN                           0x0
#define _CLCIN0PPS_CLCIN0PPS_POSITION                       0x0
#define _CLCIN0PPS_CLCIN0PPS_SIZE                           0x6
#define _CLCIN0PPS_CLCIN0PPS_LENGTH                         0x6
#define _CLCIN0PPS_CLCIN0PPS_MASK                           0x3F

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0x3ADA);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 03ADAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN1PPS              :6;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0x3ADA);
// bitfield macros
#define _CLCIN1PPS_CLCIN1PPS_POSN                           0x0
#define _CLCIN1PPS_CLCIN1PPS_POSITION                       0x0
#define _CLCIN1PPS_CLCIN1PPS_SIZE                           0x6
#define _CLCIN1PPS_CLCIN1PPS_LENGTH                         0x6
#define _CLCIN1PPS_CLCIN1PPS_MASK                           0x3F

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0x3ADB);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 03ADBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN2PPS              :6;
    };
} CLCIN2PPSbits_t;
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x3ADB);
// bitfield macros
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x6
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x6
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x3F

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x3ADC);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 03ADCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :6;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x3ADC);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x6
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x6
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x3F

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x3ADD);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 03ADDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACTPPS               :6;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x3ADD);
// bitfield macros
#define _ADACTPPS_ADACTPPS_POSN                             0x0
#define _ADACTPPS_ADACTPPS_POSITION                         0x0
#define _ADACTPPS_ADACTPPS_SIZE                             0x6
#define _ADACTPPS_ADACTPPS_LENGTH                           0x6
#define _ADACTPPS_ADACTPPS_MASK                             0x3F

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
extern volatile unsigned char           SPI1SCKPPS          __at(0x3ADE);
#ifndef _LIB_BUILD
asm("SPI1SCKPPS equ 03ADEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SCKPPS             :6;
    };
} SPI1SCKPPSbits_t;
