GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.h
// Register: DMA2DSA
#define DMA2DSA DMA2DSA
extern volatile unsigned short          DMA2DSA             __at(0x3BD0);
#ifndef _LIB_BUILD
asm("DMA2DSA equ 03BD0h");
#endif

// Register: DMA2DSAL
#define DMA2DSAL DMA2DSAL
extern volatile unsigned char           DMA2DSAL            __at(0x3BD0);
#ifndef _LIB_BUILD
asm("DMA2DSAL equ 03BD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA0                   :1;
        unsigned DSA1                   :1;
        unsigned DSA2                   :1;
        unsigned DSA3                   :1;
        unsigned DSA4                   :1;
        unsigned DSA5                   :1;
        unsigned DSA6                   :1;
        unsigned DSA7                   :1;
    };
    struct {
        unsigned DMA2DSA                :8;
    };
    struct {
        unsigned DMA2DSA0               :1;
        unsigned DMA2DSA1               :1;
        unsigned DMA2DSA2               :1;
        unsigned DMA2DSA3               :1;
        unsigned DMA2DSA4               :1;
        unsigned DMA2DSA5               :1;
        unsigned DMA2DSA6               :1;
        unsigned DMA2DSA7               :1;
    };
} DMA2DSALbits_t;
extern volatile DMA2DSALbits_t DMA2DSALbits __at(0x3BD0);
// bitfield macros
#define _DMA2DSAL_DSA_POSN                                  0x0
#define _DMA2DSAL_DSA_POSITION                              0x0
#define _DMA2DSAL_DSA_SIZE                                  0x8
#define _DMA2DSAL_DSA_LENGTH                                0x8
#define _DMA2DSAL_DSA_MASK                                  0xFF
#define _DMA2DSAL_DSA0_POSN                                 0x0
#define _DMA2DSAL_DSA0_POSITION                             0x0
#define _DMA2DSAL_DSA0_SIZE                                 0x1
#define _DMA2DSAL_DSA0_LENGTH                               0x1
#define _DMA2DSAL_DSA0_MASK                                 0x1
#define _DMA2DSAL_DSA1_POSN                                 0x1
#define _DMA2DSAL_DSA1_POSITION                             0x1
#define _DMA2DSAL_DSA1_SIZE                                 0x1
#define _DMA2DSAL_DSA1_LENGTH                               0x1
#define _DMA2DSAL_DSA1_MASK                                 0x2
#define _DMA2DSAL_DSA2_POSN                                 0x2
#define _DMA2DSAL_DSA2_POSITION                             0x2
#define _DMA2DSAL_DSA2_SIZE                                 0x1
#define _DMA2DSAL_DSA2_LENGTH                               0x1
#define _DMA2DSAL_DSA2_MASK                                 0x4
#define _DMA2DSAL_DSA3_POSN                                 0x3
#define _DMA2DSAL_DSA3_POSITION                             0x3
#define _DMA2DSAL_DSA3_SIZE                                 0x1
#define _DMA2DSAL_DSA3_LENGTH                               0x1
#define _DMA2DSAL_DSA3_MASK                                 0x8
#define _DMA2DSAL_DSA4_POSN                                 0x4
#define _DMA2DSAL_DSA4_POSITION                             0x4
#define _DMA2DSAL_DSA4_SIZE                                 0x1
#define _DMA2DSAL_DSA4_LENGTH                               0x1
#define _DMA2DSAL_DSA4_MASK                                 0x10
#define _DMA2DSAL_DSA5_POSN                                 0x5
#define _DMA2DSAL_DSA5_POSITION                             0x5
#define _DMA2DSAL_DSA5_SIZE                                 0x1
#define _DMA2DSAL_DSA5_LENGTH                               0x1
#define _DMA2DSAL_DSA5_MASK                                 0x20
#define _DMA2DSAL_DSA6_POSN                                 0x6
#define _DMA2DSAL_DSA6_POSITION                             0x6
#define _DMA2DSAL_DSA6_SIZE                                 0x1
#define _DMA2DSAL_DSA6_LENGTH                               0x1
#define _DMA2DSAL_DSA6_MASK                                 0x40
#define _DMA2DSAL_DSA7_POSN                                 0x7
#define _DMA2DSAL_DSA7_POSITION                             0x7
#define _DMA2DSAL_DSA7_SIZE                                 0x1
#define _DMA2DSAL_DSA7_LENGTH                               0x1
#define _DMA2DSAL_DSA7_MASK                                 0x80
#define _DMA2DSAL_DMA2DSA_POSN                              0x0
#define _DMA2DSAL_DMA2DSA_POSITION                          0x0
#define _DMA2DSAL_DMA2DSA_SIZE                              0x8
#define _DMA2DSAL_DMA2DSA_LENGTH                            0x8
#define _DMA2DSAL_DMA2DSA_MASK                              0xFF
#define _DMA2DSAL_DMA2DSA0_POSN                             0x0
#define _DMA2DSAL_DMA2DSA0_POSITION                         0x0
#define _DMA2DSAL_DMA2DSA0_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA0_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA0_MASK                             0x1
#define _DMA2DSAL_DMA2DSA1_POSN                             0x1
#define _DMA2DSAL_DMA2DSA1_POSITION                         0x1
#define _DMA2DSAL_DMA2DSA1_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA1_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA1_MASK                             0x2
#define _DMA2DSAL_DMA2DSA2_POSN                             0x2
#define _DMA2DSAL_DMA2DSA2_POSITION                         0x2
#define _DMA2DSAL_DMA2DSA2_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA2_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA2_MASK                             0x4
#define _DMA2DSAL_DMA2DSA3_POSN                             0x3
#define _DMA2DSAL_DMA2DSA3_POSITION                         0x3
#define _DMA2DSAL_DMA2DSA3_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA3_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA3_MASK                             0x8
#define _DMA2DSAL_DMA2DSA4_POSN                             0x4
#define _DMA2DSAL_DMA2DSA4_POSITION                         0x4
#define _DMA2DSAL_DMA2DSA4_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA4_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA4_MASK                             0x10
#define _DMA2DSAL_DMA2DSA5_POSN                             0x5
#define _DMA2DSAL_DMA2DSA5_POSITION                         0x5
#define _DMA2DSAL_DMA2DSA5_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA5_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA5_MASK                             0x20
#define _DMA2DSAL_DMA2DSA6_POSN                             0x6
#define _DMA2DSAL_DMA2DSA6_POSITION                         0x6
#define _DMA2DSAL_DMA2DSA6_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA6_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA6_MASK                             0x40
#define _DMA2DSAL_DMA2DSA7_POSN                             0x7
#define _DMA2DSAL_DMA2DSA7_POSITION                         0x7
#define _DMA2DSAL_DMA2DSA7_SIZE                             0x1
#define _DMA2DSAL_DMA2DSA7_LENGTH                           0x1
#define _DMA2DSAL_DMA2DSA7_MASK                             0x80

