GopalSaraf/Practicals/PSDL/include/proc/pic18lf55k42.h
extern volatile I2C2BTObits_t I2C2BTObits __at(0x3D66);
// bitfield macros
#define _I2C2BTO_BTO_POSN                                   0x0
#define _I2C2BTO_BTO_POSITION                               0x0
#define _I2C2BTO_BTO_SIZE                                   0x8
#define _I2C2BTO_BTO_LENGTH                                 0x8
#define _I2C2BTO_BTO_MASK                                   0xFF
#define _I2C2BTO_I2CBTO_POSN                                0x0
#define _I2C2BTO_I2CBTO_POSITION                            0x0
#define _I2C2BTO_I2CBTO_SIZE                                0x8
#define _I2C2BTO_I2CBTO_LENGTH                              0x8
#define _I2C2BTO_I2CBTO_MASK                                0xFF
#define _I2C2BTO_BTO0_POSN                                  0x0
#define _I2C2BTO_BTO0_POSITION                              0x0
#define _I2C2BTO_BTO0_SIZE                                  0x1
#define _I2C2BTO_BTO0_LENGTH                                0x1
#define _I2C2BTO_BTO0_MASK                                  0x1
#define _I2C2BTO_BTO1_POSN                                  0x1
#define _I2C2BTO_BTO1_POSITION                              0x1
#define _I2C2BTO_BTO1_SIZE                                  0x1
#define _I2C2BTO_BTO1_LENGTH                                0x1
#define _I2C2BTO_BTO1_MASK                                  0x2
#define _I2C2BTO_BTO2_POSN                                  0x2
#define _I2C2BTO_BTO2_POSITION                              0x2
#define _I2C2BTO_BTO2_SIZE                                  0x1
#define _I2C2BTO_BTO2_LENGTH                                0x1
#define _I2C2BTO_BTO2_MASK                                  0x4
#define _I2C2BTO_I2CBTO0_POSN                               0x0
#define _I2C2BTO_I2CBTO0_POSITION                           0x0
#define _I2C2BTO_I2CBTO0_SIZE                               0x1
#define _I2C2BTO_I2CBTO0_LENGTH                             0x1
#define _I2C2BTO_I2CBTO0_MASK                               0x1
#define _I2C2BTO_I2CBTO1_POSN                               0x1
#define _I2C2BTO_I2CBTO1_POSITION                           0x1
#define _I2C2BTO_I2CBTO1_SIZE                               0x1
#define _I2C2BTO_I2CBTO1_LENGTH                             0x1
#define _I2C2BTO_I2CBTO1_MASK                               0x2
#define _I2C2BTO_I2CBTO2_POSN                               0x2
#define _I2C2BTO_I2CBTO2_POSITION                           0x2
#define _I2C2BTO_I2CBTO2_SIZE                               0x1
#define _I2C2BTO_I2CBTO2_LENGTH                             0x1
#define _I2C2BTO_I2CBTO2_MASK                               0x4

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
extern volatile unsigned char           I2C1RXB             __at(0x3D6A);
#ifndef _LIB_BUILD
asm("I2C1RXB equ 03D6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C1RXBbits_t;
extern volatile I2C1RXBbits_t I2C1RXBbits __at(0x3D6A);
// bitfield macros
#define _I2C1RXB_RXB_POSN                                   0x0
#define _I2C1RXB_RXB_POSITION                               0x0
#define _I2C1RXB_RXB_SIZE                                   0x8
#define _I2C1RXB_RXB_LENGTH                                 0x8
#define _I2C1RXB_RXB_MASK                                   0xFF

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
extern volatile unsigned char           I2C1TXB             __at(0x3D6B);
#ifndef _LIB_BUILD
asm("I2C1TXB equ 03D6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C1TXBbits_t;
extern volatile I2C1TXBbits_t I2C1TXBbits __at(0x3D6B);
// bitfield macros
#define _I2C1TXB_TXB_POSN                                   0x0
#define _I2C1TXB_TXB_POSITION                               0x0
#define _I2C1TXB_TXB_SIZE                                   0x8
#define _I2C1TXB_TXB_LENGTH                                 0x8
#define _I2C1TXB_TXB_MASK                                   0xFF

// Register: I2C1CNT
#define I2C1CNT I2C1CNT
extern volatile unsigned char           I2C1CNT             __at(0x3D6C);
#ifndef _LIB_BUILD
asm("I2C1CNT equ 03D6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
} I2C1CNTbits_t;
extern volatile I2C1CNTbits_t I2C1CNTbits __at(0x3D6C);
// bitfield macros
#define _I2C1CNT_CNT_POSN                                   0x0
#define _I2C1CNT_CNT_POSITION                               0x0
#define _I2C1CNT_CNT_SIZE                                   0x8
#define _I2C1CNT_CNT_LENGTH                                 0x8
#define _I2C1CNT_CNT_MASK                                   0xFF
#define _I2C1CNT_CNT0_POSN                                  0x0
#define _I2C1CNT_CNT0_POSITION                              0x0
#define _I2C1CNT_CNT0_SIZE                                  0x1
#define _I2C1CNT_CNT0_LENGTH                                0x1
#define _I2C1CNT_CNT0_MASK                                  0x1
#define _I2C1CNT_CNT1_POSN                                  0x1
#define _I2C1CNT_CNT1_POSITION                              0x1
#define _I2C1CNT_CNT1_SIZE                                  0x1
#define _I2C1CNT_CNT1_LENGTH                                0x1
#define _I2C1CNT_CNT1_MASK                                  0x2
#define _I2C1CNT_CNT2_POSN                                  0x2
#define _I2C1CNT_CNT2_POSITION                              0x2
#define _I2C1CNT_CNT2_SIZE                                  0x1
#define _I2C1CNT_CNT2_LENGTH                                0x1
#define _I2C1CNT_CNT2_MASK                                  0x4
#define _I2C1CNT_CNT3_POSN                                  0x3
#define _I2C1CNT_CNT3_POSITION                              0x3
#define _I2C1CNT_CNT3_SIZE                                  0x1
#define _I2C1CNT_CNT3_LENGTH                                0x1
#define _I2C1CNT_CNT3_MASK                                  0x8
#define _I2C1CNT_CNT4_POSN                                  0x4
#define _I2C1CNT_CNT4_POSITION                              0x4
#define _I2C1CNT_CNT4_SIZE                                  0x1
#define _I2C1CNT_CNT4_LENGTH                                0x1
#define _I2C1CNT_CNT4_MASK                                  0x10
#define _I2C1CNT_CNT5_POSN                                  0x5
#define _I2C1CNT_CNT5_POSITION                              0x5
#define _I2C1CNT_CNT5_SIZE                                  0x1
#define _I2C1CNT_CNT5_LENGTH                                0x1
#define _I2C1CNT_CNT5_MASK                                  0x20
#define _I2C1CNT_CNT6_POSN                                  0x6
#define _I2C1CNT_CNT6_POSITION                              0x6
#define _I2C1CNT_CNT6_SIZE                                  0x1
#define _I2C1CNT_CNT6_LENGTH                                0x1
#define _I2C1CNT_CNT6_MASK                                  0x40
#define _I2C1CNT_CNT7_POSN                                  0x7
#define _I2C1CNT_CNT7_POSITION                              0x7
#define _I2C1CNT_CNT7_SIZE                                  0x1
#define _I2C1CNT_CNT7_LENGTH                                0x1
#define _I2C1CNT_CNT7_MASK                                  0x80

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
extern volatile unsigned char           I2C1ADB0            __at(0x3D6D);
#ifndef _LIB_BUILD
asm("I2C1ADB0 equ 03D6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB0bits_t;
